Revit 2027 API
RebarShapeConstraint180DegreeBendRadius Class
 A constraint which can be applied to a RebarShapeSegment, and causes the segment to be replaced with a 180-degree arc. The associated parameter drives the radius of the arc.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendRadius
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeConstraint180DegreeBendRadius : RebarShapeConstraint
Public Class RebarShapeConstraint180DegreeBendRadius
	Inherits RebarShapeConstraint
public ref class RebarShapeConstraint180DegreeBendRadius : public RebarShapeConstraint
type RebarShapeConstraint180DegreeBendRadius =
    class
        inherit RebarShapeConstraint
    end
The RebarShapeConstraint180DegreeBendRadius type exposes the following members.
Constructors
Name | Description
RebarShapeConstraint180DegreeBendRadius |  Create a 180-degree bend constraint driven by radius.
Top
Properties
Name | Description
ArcReferenceType |  A choice of rule for measuring the radius.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RebarShapeConstraint)
Top
Methods
Name | Description
Dispose
(Inherited from RebarShapeConstraint)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetParamId |  Return the Id of the parameter associated with this constraint.
(Inherited from RebarShapeConstraint)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace